#include "stm32f10x.h"
#include "usart.h"
#include "LD3320.h"

/*************端口信息********************
 * 接线说明
 LD3320接口     STM32F103ZET6接口
 * RST              PB15
 * IRQ              PB12
 * WR/SPIS          PB13
 * CS   	          PA4
 * P2/SDCK          PA5
 * P1/SDO           PA6
 * P0/SDI           PA7

 
*****************************************/


/******************************************************************************/

int main(void)
{
	USART_init();

	printf("\r\n 开始运行LD3320测试程序 \r\n");	
	LD3320_main();				//LD3320执行函数
	for(;;)
	{
		
	}
}
/*********************************************END OF FILE**********************/
